IDENTIFICATION DIVISION.
PROGRAM-ID. teste3.

DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-STUDENT-NAME PIC X(29).
 01 WS-DATE PIC X(10).

PROCEDURE DIVISION.
 ACCEPT WS-STUDENT-NAME.
 ACCEPT WS-DATE FROM DATE.
 DISPLAY "NAME : "WS-STUDENT-NAME.
 DISPLAY "DATE : "WS-DATE.

STOP RUN.
