IDENTIFICATION DIVISION.
PROGRAM-ID. teste4.

DATA DIVISION.
WORKING-STORAGE SECTION.
     01 WS-NUM1 PIC 9(9)V9(2).
     01 WS-NUM2 PIC 9(9)V9(2).
     01 WS-NUM3 PIC 9(9)V9(2).
     01 WS-NUMA PIC 9(9)V9(2).

PROCEDURE DIVISION.
 ACCEPT WS-NUM1.
 ACCEPT WS-NUM2.
 ACCEPT WS-NUMA.

 COMPUTE WS-NUM3 = (WS-NUM1 * WS-NUM2) / WS-NUMA.

 DISPLAY "WS-NUM1 :" WS-NUM1.
 DISPLAY "WS-NUM2 :" WS-NUM2.
 DISPLAY "WS-NUMA :" WS-NUMA.
 DISPLAY "WS-NUM3 :" WS-NUM3.

STOP RUN.
