IDENTIFICATION DIVISION.
PROGRAM-ID. folha_pagamento.

ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
  SELECT PAYMENT ASSIGN TO "C:/Users/carlos/Desktop/COBOL/OUTPUT.txt"
  ORGANIZATION IS SEQUENTIAL.


 DATA DIVISION.
 FILE SECTION.
 FD PAYMENT.
 01 PAYMENT-RECORD.
  05 WORKER-OUTPUT PIC A(30).
  05 SALARYHOUR-OUTPUT PIC 9(3)V9(2).
  05 HOURS-OUTPUT PIC 9(3)V9(2).
  05 SALMONTH1-OUTPUT PIC 9(6)V9(2).
  05 INSS2-OUTPUT PIC 9(2)V9(1).
  05 INSS3-OUTPUT PIC 9(4)V9(1).
  05 TAX2-OUTPUT PIC 9(2)V9(1).
  05 TAX3-OUTPUT PIC 9(4)V9(2).
  05 SALMONTHTOTAL-OUTPUT PIC 9(6)V9(2).

WORKING-STORAGE SECTION.
   01 WS-WORKER PIC A(30).
   01 WS-SALARYHOUR PIC 9(3)V9(2).
   01 WS-HOURS PIC 9(3)V9(2).
   01 WS-SALMONTH PIC 9(6)V9(2).
   01 WS-SALMONTHTOTAL PIC 9(6)V9(2).
   01 WS-SALMONTH1 PIC 9(6)V9(2).
   01 WS-TAX PIC 9(1)V9(4).
   01 WS-TAX2 PIC 9(2)V9(1).
   01 WS-TAX3 PIC 9(4)V9(2).
   01 WS-INSS PIC 9(1)V9(4).
   01 WS-INSS2 PIC 9(2)V9(1).
   01 WS-INSS3 PIC 9(4)V9(1).
   01 WS-LINE         PIC X(75).
   01 WS-LINE1        PIC X(75).
   01 WS-LINE2        PIC X(75).
   01 WS-LINE3        PIC X(75).
   01 WS-LINE4        PIC X(75).
   01 WS-LINE5        PIC X(75).
   01 WS-LINE6        PIC X(75).
   01 WS-LINE7        PIC X(75).


 PROCEDURE DIVISION.
  DISPLAY "INSERT WORKER NAME: "ACCEPT WS-WORKER.
  DISPLAY "INSERT SALARY PER HOUR: "ACCEPT WS-SALARYHOUR.
  DISPLAY "INSERT HOURS WORKED: "ACCEPT WS-HOURS.

 COMPUTE WS-SALMONTH1 = WS-SALARYHOUR * WS-HOURS


 EVALUATE TRUE
   WHEN WS-SALMONTH1 < 1518.01
    MOVE 0 TO WS-INSS
    MOVE 0 TO WS-INSS2

   WHEN WS-SALMONTH1 = 1518.01 OR (WS-SALMONTH1 > 1518.01 AND WS-SALMONTH1 < 2793.89)
    MOVE 0.075 TO WS-INSS
    MOVE 7.5 TO WS-INSS2

   WHEN WS-SALMONTH1 = 2793.89 OR (WS-SALMONTH1 > 2793.89 AND WS-SALMONTH1 < 4190.84)
    MOVE 0.12 TO WS-INSS
    MOVE 12 TO WS-INSS2

   WHEN WS-SALMONTH1 = 4190.84 OR (WS-SALMONTH1 > 4819.84 AND WS-SALMONTH1 < 8157.42)
    MOVE 0.14 TO WS-INSS
    MOVE 14 TO WS-INSS2

   WHEN WS-SALMONTH1 > 8157.41
    MOVE 0.14 TO WS-INSS
    MOVE 14 TO WS-INSS2

 END-EVALUATE

 COMPUTE WS-SALMONTH = WS-SALMONTH1 - (WS-INSS * WS-SALMONTH1)
 COMPUTE WS-INSS3 = WS-SALMONTH1 * WS-INSS

  EVALUATE TRUE
   WHEN WS-SALMONTH < 3036
    MOVE 0 TO WS-TAX
    MOVE 0 TO WS-TAX2

   WHEN WS-SALMONTH = 3036 OR (WS-SALMONTH > 3036 AND WS-SALMONTH < 3533.31)
    MOVE 0.075 TO WS-TAX
    MOVE 7.5 TO WS-TAX2

   WHEN WS-SALMONTH = 3533.31 OR (WS-SALMONTH > 3533.31 AND WS-SALMONTH < 4668.85)
    MOVE 0.15 TO WS-TAX
    MOVE 15 TO WS-TAX2

   WHEN WS-SALMONTH = 4668.85 OR (WS-SALMONTH > 4668.85 AND WS-SALMONTH < 5830.85)
    MOVE 0.225 TO WS-TAX
    MOVE 22.5 TO WS-TAX2

   WHEN WS-SALMONTH > 5830.85
    MOVE 0.275 TO WS-TAX
    MOVE 27.5 TO WS-TAX2
  END-EVALUATE

 COMPUTE WS-SALMONTHTOTAL = WS-SALMONTH - (WS-TAX * WS-SALMONTH)
 COMPUTE WS-TAX3 = WS-TAX * WS-SALMONTH


  DISPLAY "WORKER NAME: " WS-WORKER.
  DISPLAY "SALARY PER HOUR: " WS-SALARYHOUR.
  DISPLAY "HOURS WORKED: " WS-HOURS.
  DISPLAY "MONTH'S RAW SALARY: " WS-SALMONTH1.
  DISPLAY "INSS %: " WS-INSS2"($"WS-INSS3")".
  DISPLAY "TAXES %: " WS-TAX2"($"WS-TAX3")".
  DISPLAY "LIQUID SALARY: "WS-SALMONTHTOTAL.

 STRING
   "WORKER NAME: "        DELIMITED BY SIZE
   WS-WORKER              DELIMITED BY SIZE
   INTO WS-LINE1
END-STRING

STRING
   "SALARY PER HOUR: "    DELIMITED BY SIZE
   WS-SALARYHOUR          DELIMITED BY SIZE
   INTO WS-LINE2
END-STRING

STRING
   "HOURS WORKED: "       DELIMITED BY SIZE
   WS-HOURS               DELIMITED BY SIZE
   INTO WS-LINE3
END-STRING

STRING
   "MONTH'S RAW SALARY: " DELIMITED BY SIZE
   WS-SALMONTH1           DELIMITED BY SIZE
   INTO WS-LINE4
END-STRING

STRING
   "INSS %: "             DELIMITED BY SIZE
   WS-INSS2              DELIMITED BY SIZE
   "($"                  DELIMITED BY SIZE
   WS-INSS3              DELIMITED BY SIZE
   ")"                   DELIMITED BY SIZE
   INTO WS-LINE5
END-STRING

STRING
   "TAXES %: "            DELIMITED BY SIZE
   WS-TAX2               DELIMITED BY SIZE
   "($"                  DELIMITED BY SIZE
   WS-TAX3               DELIMITED BY SIZE
   ")"                   DELIMITED BY SIZE
   INTO WS-LINE6
END-STRING

STRING
   "LIQUID SALARY: "      DELIMITED BY SIZE
   WS-SALMONTHTOTAL       DELIMITED BY SIZE
   INTO WS-LINE7
END-STRING

 INSPECT WS-LINE2 REPLACING ALL '0' BY ' '

OPEN OUTPUT PAYMENT

MOVE WS-LINE1  TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

MOVE WS-LINE2 TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

MOVE WS-LINE3 TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

MOVE WS-LINE4 TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

MOVE WS-LINE5 TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

MOVE WS-LINE6 TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

MOVE WS-LINE7 TO PAYMENT-RECORD
WRITE PAYMENT-RECORD

CLOSE PAYMENT

STOP RUN.
